Revit 2024 API
PointLightShape Constructor
Overload List
Name | Description
PointLightShape()
 Creates a point light shape object.
PointLightShape(PointLightShape)
 Creates a copy of the given point light shape
See Also
PointLightShape Class
PointLightShape Members
Autodesk.Revit.DB.Lighting Namespace